apps/frontend/src/core/store/document/requestDocumentCheque.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sir="http://sirena-travel.ru">
  <soapenv:Header />
  <soapenv:Body>
    <sir:issueDocument id="1002749096001528_20231127150930">
      <taxPayer>
        <tin></tin>
        <name>Борисов Алексей</name>
      </taxPayer>
      <instructions>
        <deviceRouting>
          <cashRegistersService>
            <messagingBroker>
              <url>amqp://aqsi-fh.scenarios.inbound:KyY9UbvDKV1@vv-bunny-03.sirena-travel.ru/AQSI</url>
              <amqp>
                <exchange>devices</exchange>
              </amqp>
            </messagingBroker>
            <cashRegister>
              <serialNumber>1002749096001528</serialNumber>
              <vendor>AQSI</vendor>
            </cashRegister>
          </cashRegistersService>
        </deviceRouting>
        <responseDelivery>
          <socketio>
            <client>
              <guid>653f4096-9596-38e9-2a8f-ab325b9f62dd</guid>
            </client>
          </socketio>
        </responseDelivery>
        <applicableExtensions>
          <!-- Количество копий -->
          <printoutCopies>
            <copies>2</copies>
          </printoutCopies>
          
          <!-- Отделы для товаров -->
          <subjectsDepartments>
            <subjects><subject><department code="1" /></subject>
<subject><department code="1" /></subject>
</subjects>
          </subjectsDepartments>
        </applicableExtensions>
      </instructions>
      <document>
        <!-- tag 1000 -->
        <cheque>
          <copies>2</copies>
          <cashier>
            <!--1021 Кассир-->
            <fullName>Борисов Алексей</fullName>
            <!--1203 ИНН кассира-->
            <tin></tin>
          </cashier>
          <pointOfSettlement>
            <!--1009 Адрес расчетов-->
            <address>г Москва, Шелепихинская наб, д 34 к 3, кв 420</address>
          </pointOfSettlement>
          <!--credit debit creditReturn debitReturn tag 1054-->
          <credit>
            <!--1055 Применяемая система налогообложения-->
            <taxationSystem codepage="fts-1.31_1#taxationSystem">0</taxationSystem>
            <customer>
              <!--1008 Телефон или электронный адрес покупателя-->
              <!--1008-->
              <phone></phone>
              <email></email>
            </customer>
            <settlement>
              <subjects>                <subject>
                  <!--1030 Наименование предмета расчета-->
                  <name>Hellblade</name>
                  <!--1079 Цена за единицу предмета расчета с Aучетом скидок и наценок-->
                  <price>1000</price>
                  <!--1023 Количество предмета расчета-->
                  <quantity>333</quantity>
                  <!--1043 Стоимость предмета расчета с учетом скидок и наценок-->
                  <amount>0</amount>
                  <!--1197 Eдиница измерения предмета расчета-->
                  <measure>777</measure>                  <signs>
                    <!--1212 Признак предмета расчета-->
                    <subject codepage="fts-1.31_1#type">7</subject>
                    <!--1214 Признак способа расчета-->
                    <method codepage="fts-1.31_1#featureOfSettlementMethod">4</method>
                  </signs>
                  <taxes>
                    <vat>
                      <!--1199 Ставка НДС-->
                      <type codepage="fts-1.31_1#vatTaxType">2</type>
                      <!--1200 Сумма НДС за предмет расчета-->
                      <amount>2</amount>
                    </vat>
                  </taxes>
<supplier><name>Redcat</name><tin>Darkcat</tin></supplier><agent><roles><Платежный агент /></roles></agent>                </subject>
                <subject>
                  <!--1030 Наименование предмета расчета-->
                  <name>Pookmon</name>
                  <!--1079 Цена за единицу предмета расчета с Aучетом скидок и наценок-->
                  <price>2000</price>
                  <!--1023 Количество предмета расчета-->
                  <quantity>222</quantity>
                  <!--1043 Стоимость предмета расчета с учетом скидок и наценок-->
                  <amount>0</amount>
                  <!--1197 Eдиница измерения предмета расчета-->
                  <measure>666</measure>                  <signs>
                    <!--1212 Признак предмета расчета-->
                    <subject codepage="fts-1.31_1#type">10</subject>
                    <!--1214 Признак способа расчета-->
                    <method codepage="fts-1.31_1#featureOfSettlementMethod">4</method>
                  </signs>
                  <taxes>
                    <vat>
                      <!--1199 Ставка НДС-->
                      <type codepage="fts-1.31_1#vatTaxType">5</type>
                      <!--1200 Сумма НДС за предмет расчета-->
                      <amount>5</amount>
                    </vat>
                  </taxes>
<agent><roles><Поверенный /></roles></agent>                </subject>

              </subjects>
            </settlement>
            <payments>
              <forms>
                <electronic>
                  <!--1031 Сумма по чеку (БСО) наличными-->
                  <amount></amount>
                </electronic>
                <cash>
                  <!--1031 Сумма по чеку (БСО) наличными-->
                  <amount></amount>
                </cash>
                <consideration>
                  <!--1217 Встречное предоставление-->
                  <amount></amount>
                </consideration>
              </forms>
              <total>
                <!--1020 Сумма расчета, указанного в чеке (БСО)-->
                <amount></amount>
              </total>
            </payments>
            <taxes>              <vat>
                <!--18%-->
                <type codepage="fts-1.31_1#vatTaxType">1</type>
                <!--1102 Сумма НДС чека по ставке 18%-->
                <amount>1</amount>
              </vat>

            </taxes>
          </credit>
        </cheque>
      </document>
    </sir:issueDocument>
  </soapenv:Body>
</soapenv:Envelope>